In [ ]:
#1. Homework
import pandas as pd
import numpy as np

data = {
    'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [2]:
#1.1 Rename column names using function. "First Name" --> "first_name", "Age" --> "age
new_name = {"First Name":"first_name", "Age":"age"}

df1 = df.rename(columns=new_name)
df1

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [3]:
#1.2 Print the first 3 rows of the DataFrame
print("First 3 rows:")
df1.head(3)

First 3 rows:

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [4]:
#1.3 Find the mean age of the individuals
mean_age = df1['age'].mean()
print("Mean age of individuals:", mean_age)

Mean age of individuals: 32.5

In [5]:
#1.4 Select and print only the 'Name' and 'City' columns
print(df1[['first_name', 'City']])

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [8]:
#1.5 Add a new column 'Salary' with random salary values
df1['Salary'] = np.random.randint(5000, 15000,size=len(df1))
df1

  first_name  age           City  Salary
0      Alice   25       New York   14865
1        Bob   30  San Francisco   13732
2    Charlie   35    Los Angeles   11784
3      David   40        Chicago    7139

In [9]:
#1.6 Display summary statistics of the DataFrame
print("Summary statistics:")
print(df.describe())

Summary statistics:
             Age
count   4.000000
mean   32.500000
std     6.454972
min    25.000000
25%    28.750000
50%    32.500000
75%    36.250000
max    40.000000

In [10]:
#2. Homework
import pandas as pd

data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}

sales_and_expenses = pd.DataFrame(data)
print("DataFrame:\n", sales_and_expenses)

DataFrame:
   Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [ ]:
#2.2 Calculate and display the maximum sales and expenses.
max_sales = sales_and_expenses['Sales'].max()
max_expenses = sales_and_expenses['Expenses'].max()
print("Maximum Sales:", max_sales)
print("Maximum Expenses:", max_expenses)

Maximum Sales: 8000
Maximum Expenses: 4500

In [14]:
#2.3 Calculate and display the minimum sales and expenses.
min_sales = sales_and_expenses.Sales.min()
min_expenses = sales_and_expenses.Expenses.min()
print("Minimum Sales:", min_sales)
print("Minimum Expenses:", min_expenses)

Minimum Sales: 5000
Minimum Expenses: 3000

In [15]:
#2.4 Calculate and display the average sales and expenses.
avg_sales = sales_and_expenses['Sales'].mean()
avg_expenses = sales_and_expenses['Expenses'].mean()
print("Average Sales:", avg_sales)
print("Average Expenses:", avg_expenses)

Average Sales: 6625.0
Average Expenses: 3750.0

In [19]:
#3. Homework
import pandas as pd

data = {
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'],
    'January': [1200, 200, 300, 150],
    'February': [1300, 220, 320, 160],
    'March': [1400, 240, 330, 170],
    'April': [1500, 250, 350, 180]
}

expenses = pd.DataFrame(data)
expenses = expenses.set_index('Category')
expenses

               January  February  March  April
Category
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    330    350
Entertainment      150       160    170    180

In [21]:
#3.2 Calculate and display the maximum expense for each category.
max_exp = expenses.max(axis=1)
print("Maximum expense for each category:\n", max_exp)

Maximum expense for each category:
 Category
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

In [22]:
#3.3 Calculate and display the minimum expense for each category.
min_exp = expenses.min(axis=1)
print("Minimum expense for each category:\n", min_exp)

Minimum expense for each category:
 Category
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

In [23]:
#3.4 Calculate and display the average expense for each category.
avg_exp = expenses.mean(axis=1)
print("Average expense for each category:\n", avg_exp)

Average expense for each category:
 Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64